/*************************************************************************
	> File Name: P1057-1.cpp
	> Author: ChongH
	> Mail: 304451676@qq.com
	> Created Time: 2018年09月07日 星期五 16时35分31秒
 ************************************************************************/

#include <stdio.h>
#define MAX 31
int f[MAX][MAX] = {0};
// 表示经过j次传到编号为i的人手里的方案数
int n, m;
int ans = 0;
// 边界条件 f[1][0] = 1
// 传到ｉ的球只能来自i+1或i-1
// i = 1 或 n 时要特殊处理,因为是个环
int main() {
    scanf("%d%d", &n, &m);
    f[1][0] = 1;
    // 个人理解:将列作为外层循环的原因:例如,f[2][2] = f[3][1] + f[1][1]
    // 要求以1为列的所有行的值都已经求出了
    for (int k = 1; k <= m; k++) {
        f[1][k] = f[2][k - 1] + f[n][k - 1];
        for (int i = 2; i <= n - 1; i++) f[i][k] = f[i - 1][k - 1] + f[i + 1][k - 1];
        f[n][k] = f[n - 1][k - 1] + f[1][k - 1];
    }
    printf("%d\n", f[1][m]);
    return 0;
}


